// 1) რა არის HTTP?
// მოკლედ ახსენი შენი სიტყვებით რას ნიშნავს HTTP და რისთვის გამოიყენება ვებსაიტებზე.

// HTTP (Hypertext Transfer Protocol) არის პროტოკოლი, რომელიც გამოიყენება ვებსაიტების და
//  ბრაუზერების შორის კომუნიკაციისთვის. HTTP საშუალებას აძლევს ბრაუზერს მოთხოვნებს გაუგზავნოს 
// ვებ სერვერს და მიიღოს პასუხები, როგორიცაა HTML ფაილები, სურათები და სხვა რესურსები. 
// HTTP არის ვებ კომუნიკაციის საფუძველი და გამოიყენება ვებსაიტების დატვირთვისა და ინფორმაციის გადაცემის
//  პროცესში.


// 2) რა განსხვავებაა HTTP request და HTTP response-ს შორის?
// დაწერე მოკლე ახსნა და მოიყვანე მაგალითი.

// HTTP request არის მოთხოვნა, რომელიც ბრაუზერი (ან სხვა კლიენტი) უგზავნის ვებ სერვერს,
//  რათა მიიღოს ინფორმაცია ან რესურსი. HTTP response არის პასუხი, რომელიც ვებ სერვერი უგზავნის ბრაუზერს,
//  როგორც პასუხი HTTP request-ზე.

// 3) ჩამოთვალე HTTP მეთოდები:
// GET
// POST
// PUT
// DELETE
// და თითოეულის გვერდით დაწერე რას აკეთებს.
// GET: გამოიყენება ინფორმაციის წამოსაღებად სერვერიდან.
// POST: გამოიყენება ახალი ინფორმაციის დასამატებლად სერვერზე.
// PUT: გამოიყენება არსებული ინფორმაციის შესაცვლელად სერვერზე.
// DELETE: გამოიყენება ინფორმაციის წასაშლელად სერვერიდან.

// 4) წარმოიდგინე რომ გაქვს საიტი წიგნებზე.
// დაწერე რომელი HTTP მეთოდი გამოიყენებოდა:
// წიგნების წამოსაღებად -` GET`
// ახალი წიგნის დასამატებლად - `POST`
// წიგნის შესაცვლელად - `PUT`
// წიგნის წასაშლელად - `DELETE`


// 5) შექმენი პატარა ობიექტი JavaScript-ში მომხმარებლის მონაცემებით და fetch-ის გამოყენებით გააგზავნე POST request.
const userData = {
    name: "John Doe",
    email: "john.doe@example.com"
};

fetch("https://example.com/api/users", {
    method: "POST",
    headers: {
        "Content-Type": "application/json"
    },
    body: JSON.stringify(userData)
})