print(2 + 2)#კომპიუტერმა ჯერ შეამოწმა ფრჩხილებში მცემული მთელი რიცხვები(int) და ისინი ერთმანეთს დაუმატა
#            რის შედეგადაც მან მიღო 4.4-ის მიღბის შემდეგ print მეშვეობით ეკრანზე გამოვიდა 4


print(5 - 3) #აქ ისევ ჯერ პირველად მოხვდა ფრჩხილებში მოცემული მთელი რიცხვების გამოკლება 
#             რის შედეგადაც მივიღეთ 2 და შემდეგ print ფუნქცით ის ეკრანზე გამოვიტანეთ

print(100 / 5) #აქ შესრულდა ფრჩხილებში მოცებული მთელი რიცხვების გაყოფა რის შედეგადაც მივიღეთ 20 
#               და print ფუნქცით ის გამოვიტანეთ ეკრანზე

print(5 * 5) #ამ ხაზში ჯერ გამრავლდა ფრჩხილებში მოცემული მთლი რიცვები ერთმანეთზე რის შედეგადაც მივიღეთ 25
#             და print ფუნქცით ის გამოვიტანე ეკრანზე

print("my name is " + "kote") #ფრჩხილებში მოცემილუ ორინ ტექსტური მონაცემი + ფინქცით ერთმანეთ შეუერთდნენ
#                              რის შედეგადაც მივიღეთ MY NAME IS KOTE მისი მიღების შემდე PRINT-ით ის გამვიტანეთეკრანზე

on = (3)

off = (4)

print(on - off) #ამ კოდში შექმნილია ორი ცვლადი on და off რომელთა მინიჯებული მნიშვნელობებია მთელი რიცხვები.print(on - off) კოდში
#ჯერ on და off ჩანაცვლდებიან მათვის მინიჯებული მნიშვნელუბებით 3 და ,რითაც მივიღებთ print(4 - 1).ჩანაცვლების შემდეგ მთელ რიცხვები ერთმანეთს
#გამოაკლდება და მივიღებთ print(-1).გამოკლების შემდეგ print ფუნქცით ეკრანზე გამოვიტანთ მიღებულ რიცხვს -1


#ტერმინალი არის ტექსტზე დაფუძნებული ინტერფეისი.მას გამოაქ ეკრანზე გაშვებული კოდი ის ასევე გვაწვდის ინფორმაციას თუ სად მდებარეობს ფაილი,რამ
#გაუშვა ეს ფაილი ის ასევე გვაჩვენებს თუ სად დავუშვით შეცდომა და იმასაც გვაჩვენებს თუ რაშია პრობლემა

#სტრინდი(str) არის მონაცემთა ტიპი რომელიც გამოიყენება ტექსტის ეკრანზე გამოსაყვანად.python-ში სტრინგი იმსევა ბრჯყალებში ორივე მხრიდან და 
# ის შედგება მრავალი სიმბოლობისგან

#მთელი რიცხვი(int) არის მონაცემთა ტიპი რომელიც გამოიყენება მთელი რიცხვების წარმოსადგენათ.მათი ერთ-ერთი პუნქცია არის არიტმეტიკული
#პროცესების შესასრულებლად,როგორიცა გამოკლება(-),დამატება(+),გამრავლება(*) და გაყოფა(/) 
